IOT Testing Case
===================
### 測試目錄
[TOC]








###測試案例說明


#### <i class="icon-pencil"></i> IOT控制台
​溫濕度圖表內容顯示：

   - 點選右方「上傳記錄列表」進行查看
    
#### <i class="icon-pencil"></i> 溫濕度圖表

溫濕度篩選功能

   - 使用下拉選單「公司名稱」，「場域類型」，「Tag類型」進行挑選點選「搜尋」

選擇要欲檢視的tag，顯示相關溫濕度圖表資訊

   - 點選下方表格進行選擇需檢視的Tag，再點選「檢視以勾選tag之記錄」

查看紀錄的即時，歷史溫濕度

   - 於記錄列表內選取「即時溫濕度」，「歷史溫濕度」，點選下方表格紀錄呈現溫濕度圖表

#### <i class="icon-pencil"></i> 圖形監控

公司名稱搜尋案場

   - 使用「公司名稱」下拉選單挑選公司後，按下「搜尋」，查看是否有切換場域列表

案場檢視圖形監控畫面

   - 點選「辦公大樓」圖示來呈現圖形監控畫面，及顯示右方tag列表

觀看溫度變化

   - 於「設定溫度變化區間」輸入年月日，然後點選「觀看溫度變化」按鈕查看Tag圖示顏色變化

#### <i class="icon-pencil"></i> 公司管理 / 公司基本資料設定

新增公司

   - 點選「新增公司」按鈕，輸入相關公司名稱，地址，電話後點選「儲存設定」

修改公司

   - 點選公司表格內「編輯」，修改公司相關設定，完成後點選「儲存設定」

刪除公司

   - 點選公司表格內「勾選方塊」，完成後點選「刪除已勾選公司」


#### <i class="icon-pencil"></i> 公司管理 / 群組管理設定

新增群組

   - 點選「新增群組」按鈕，輸入相關群組名稱，完成後點選「儲存設定」

修改群組

   - 點選群組表格內「編輯」，修改「群組名稱」以及勾選「場域名稱」，完成後點選「儲存設定」

刪除群組

   - 點選群組表格內「勾選方塊」，完成後點選「刪除已勾選群組」


#### <i class="icon-pencil"></i> 公司管理 / 使用者管理設定

新增使用者

   - 點選「新增使用者」按鈕，輸入相關使用者資訊，完成後點選「儲存設定」

修改使用者

   - 點選使用者表格內「編輯」，修改相關使用者資訊，以及勾選「群組編號」，完成後點選「儲存設定」

刪除使用者
  
  - 點選使用者表格內「勾選方塊」，完成後點選「刪除已勾選群組」

#### <i class="icon-pencil"></i> 公司管理 / 場域管理

... 等待補充





 











